// 1 задача
// Есть 90 человек. Каждый из этих 90 человек относится к одной из двух категорий. Одни на все вопросы говорят правду, другие — всегда врут. У каждого ровно 1 любимое блюдо из списка (макароны/пельмени/вареники). Каждому задают три вопроса:
// Ваше любимое блюдо — макароны?
// Ваше любимое блюдо — пельмени?
// Ваше любимое блюдо — вареники?
// Результаты получились такие: 
// на первый вопрос утвердительно ответило 45 человек,
// на второй — 35,
// на третий — 30.
// Сколько человек всегда говорят правду?
// Если нам известно что у каждого человека 1 любимое блюдо => 
// 45+35+30=110 положительных ответов => 
// лжецы всегда врут => 
// из 3 вопросов 2 будут положительными у лжецов, из 3 вопросов 1 будет положительным у честных людей => 
// 110-90=20 разница между 